In [2]:
import numpy as np
import pandas as pd

A = pd.DataFrame(np.random.rand(3,3), columns = list('ABC'))
B = pd.DataFrame(np.random.rand(3,3), columns = list('ABD'))

In [3]:
A

          A         B         C
0  0.649546  0.494602  0.305345
1  0.026917  0.205017  0.958867
2  0.678277  0.150334  0.690846

In [18]:

S = pd.Series(np.arange(1,4), index=list('ABD'))

In [19]:
S

A    1
B    2
D    3
dtype: int64

In [20]:
A-S

          A         B   C   D
0 -0.888588 -1.222718 NaN NaN
1 -0.044257 -1.367614 NaN NaN
2 -0.687932 -1.434388 NaN NaN

In [21]:
A.sub(B, fill_value = 0)

          A         B         C         D
0 -0.169833  0.737621  0.952297 -0.809626
1  0.157041  0.331652  0.166111 -0.755369
2 -0.601649 -0.319015  0.483189 -0.012419

In [22]:
A.iloc[0,2]

0.9522967933988813

In [23]:
A.iloc[0:3,0:3]

          A         B         C
0  0.111412  0.777282  0.952297
1  0.955743  0.632386  0.166111
2  0.312068  0.565612  0.483189

In [24]:
A.loc[0:1,'A':'B'] = B.loc[1:2,'B':'C']

In [25]:
A

          A         B         C
0       NaN       NaN  0.952297
1       NaN  0.300735  0.166111
2  0.312068  0.565612  0.483189

In [26]:
B

          A         B         D
0  0.281245  0.039661  0.809626
1  0.798702  0.300735  0.755369
2  0.913717  0.884627  0.012419

In [27]:
A.iloc[0:2,0:2] = B.iloc[1:3,1:3] # check index extending

In [28]:
A

          A         B         C
0       NaN       NaN  0.952297
1       NaN  0.300735  0.166111
2  0.312068  0.565612  0.483189

In [36]:


A.dropna(thresh=2) # remove a row with minimum 2 NaN

          A         B         C
1       NaN  0.300735  0.166111
2  0.312068  0.565612  0.483189

In [15]:
A.dropna(axis='columns') # remove column with NaN

          C
0  0.930592
1  0.033133
2  0.747545

In [10]:
#Multi index
MB = pd.DataFrame(np.random.rand(3,3), index=[['A','A','C'],[1988,1988,200]],columns=['G','D','H'])

In [11]:
MB

               G         D         H
A 1988  0.623275  0.261816  0.360238
  1988  0.178007  0.394249  0.996650
C 200   0.752053  0.699398  0.492996

In [21]:
MB['G']

A  1988    0.623275
   1988    0.178007
C  200     0.752053
Name: G, dtype: float64

In [ ]:
MB.loc[]